[
  {
    "Documentation Date": "Sept 15, 2025",
    "Key Player": "P&G",
    "Key Topics & Issues": "AI-Powered Ad Testing Cut Optimization Time from Weeks to Days. \n\nThe traditional ad testing at P&G relied on time-intensive focus groups, manual creative iterations, and siloed media negotiations, resulting in slow campaign rollouts and inflated costs. These factors began to undermine agility in a market demanding faster, more personalized advertising.\n\nManual creative reviews and spreadsheet-driven budget modelling demanded specialized teams for data wrangling rather than strategic campaign improvements. Poor scalability of manual processes meant:",
    "Business Case": "P&G uses a layered AI architecture combining generative models for creative ideation, predictive analytics for multivariate testing, and programmatic media buying to compress cycles and reduce costs. \n\nIt will be:\n- Fully autonomous campaign orchestration with minimal human oversight\n- Hyper-personalized creative tailored to individual behavioral signals\n- Cross-channel attribution models powered by deep-learning networks",
    "How (Technical)": "- Generative Creative Module by the LLM model that can auto craete copy and imagery\n- Predictive analytics engine by Random forest & XGBoost that forecast variant performance\n- Real time experimentation using bayesian bandit models that can allocates traffic to high-ROI variants\n- Media buying orchestrator using reinforcement learning to oprimizes bids and budget pricing",
    "Demo": "",
    "Source": "https://chiefaiofficer.com/blog/how-pg-uses-ai-marketing-optimization-to-cut-costs-by-90/",
    "Relevance": "No"
  },
  {
    "Documentation Date": "2025-03-27T00:00:00",
    "Key Player": "Unilever",
    "Key Topics & Issues": "Product shoots reinvention with AI for faster content creation\n\nNew technology that combines AI, physics, data and material science is helping our Marketing teams create high-quality product imagery faster and more cost-effectively. Discover how digital twin technology is evolving our approach to content.\n\n",
    "Business Case": "- Creating digital twins for the brands\n- Executing campaigns with creativity and autonomous workflow",
    "How (Technical)": "- Create digital twins of every pack, using technology such as Real-Time 3D, Nvidia Omniverse and OpenUSD, where these 3D replicas reflect every measurement, shade and shape to provide a completely accurate digital representation of a product at a level of realism we’ve never been able to achieve before.\n- Integrate product images into our AI-enhanced creative workflows",
    "Demo": "https://youtu.be/-awgCOqcXGs",
    "Source": "https://www.unileverusa.com/news/2025/unilever-reinvents-product-shoots-with-ai-for-faster-content-creation/",
    "Relevance": "Yes"
  },
  {
    "Documentation Date": "-",
    "Key Player": "Nestle x IBM",
    "Key Topics & Issues": "Nestle and IBM scientist leverated AI-based processing techniques to construct a knowledge base of known materials from public and proprietary document then fine-tuned a fit-for-purpose chemical language model on the curated corpus\n\n",
    "Business Case": "- Finding the relevant document by checking into the internal corpus",
    "How (Technical)": "LLM + RAG (Generative AI), where the recipe is stored then advanced algorithms will help product developers to better manage tradeoffs between ingredients, nutrition, cost and sustainability",
    "Demo": "",
    "Source": "https://www.nestleusa.com/stories/unlocking-new-opportunities-gen-ai",
    "Relevance": "No"
  },
  {
    "Documentation Date": "-",
    "Key Player": "Unilever",
    "Key Topics & Issues": "AI in supply chain and consumer connectivity.  Ice Cream Division: Leveraging weather and sales data, Unilever uses AI to make forecasts more agile. For example, forecast accuracy in Sweden’s ice-cream market improved ~10%. 100,000 “AI-enabled” retail freezers (sending inventory data in real time) helped boost orders and sales by up to 30%\n\nUsing AI we understand where to sell; how much we are going to sell; in which cabinet we are going to sell; and when and where to send our orders",
    "Business Case": "- Forecast the sales data for a specific brand",
    "How (Technical)": "Create a forecasting model based on the given dataset",
    "Demo": "",
    "Source": "https://www.unilever.com/news/news-search/2025/how-ai-is-transforming-unilever-ice-creams-end-to-end-supply-chain/#:~:text=%2A%20Data%20from%20100%2C000%20AI,sales%20by%20up%20to%2030",
    "Relevance": "No"
  },
  {
    "Documentation Date": "Sept 2024",
    "Key Player": "Mondelez x Accenture",
    "Key Topics & Issues": "Collabrate with accenture to launch a generative-AI marketing platform to enable content creation (text, image, video) at scale with built-in data, brand safety, and legal ",
    "Business Case": "- Produce \"contextual insights\" and support A/B testing and personalization across customer touchpoints",
    "How (Technical)": "Using current multimodal LLM capability into their data platform",
    "Demo": "",
    "Source": "https://newsroom.accenture.com/news/2024/mondelez-international-joins-forces-with-accenture-and-publicis-groupe-to-advance-ai-powered-marketing-capabilities#:~:text=Working%20in%20collaboration%20with%20Accenture,changing%20consumer%20tastes%20and%20interests",
    "Relevance": "No"
  },
  {
    "Documentation Date": "-",
    "Key Player": "Reckit x BCGX",
    "Key Topics & Issues": "Used AI to analyze 300K+ data points for product emissions. ",
    "Business Case": "",
    "How (Technical)": "",
    "Demo": "",
    "Source": "https://www.reckitt.com/media-landing/press-releases/2024/reckitt-s-first-genai-results-demonstrate-changing-face-of-marketing-during-cannes-lions-international-festival-of-creativity/#:~:text=,faster%20ad%20adaptation%20and%20localisation",
    "Relevance": "No"
  },
  {
    "Documentation Date": "2025-02-05T00:00:00",
    "Key Player": "Heineken",
    "Key Topics & Issues": "Customer-centric AI products that are seamlessly integrated into our operations and widely adopted by end-users. We support this with robust capabilities that enhance AI literacy across the organisation. This will pave the way from everyday AI to game-changing AI, enabling our people to do what they are best at: shape the future of beer and beyond to win the heart of our consumers.",
    "Business Case": "- Build AIDA (transforming sales rep into business advisors)\n\nAIDDA  - short for AI Data-Driven Advisor – supports sales reps by predicting the best actions for them to take with a customer, accelerating their transformation into true business advisors and increasing sales productivity. AIDDA uses AI to identify the next best action to take and select the right touchpoint to execute it, based on value potential and informed by business strategy.",
    "How (Technical)": "Embedding AIDDA and other analytics products for data-driven sales into existing CRM applications and B2B platforms.",
    "Demo": "",
    "Source": "https://www.theheinekencompany.com/newsroom/brewing-with-ai/",
    "Relevance": "Yes"
  },
  {
    "Documentation Date": "2025-02-05T00:00:00",
    "Key Player": "Heineken",
    "Key Topics & Issues": "Developing effective promotion strategies with Promo Advisor",
    "Business Case": "Promo Advisor is using machine learning to support commercial teams in managing promotions in an optimal way. It enables the planning and optimisation of targeted promotions, boosting sales and ROI ",
    "How (Technical)": "Promo Advisor provides thee core functionalities. \n\n- First, the DECOMPOSER identifies the drivers behind successful promotions by analysing past promotions. \n\n- The SIMULATOR enables commerce teams to simulate and calculate the expected uplift from their planned promo calendars by testing different promotional scenarios at speed. \n\n- The OPTIMISER creates the optimal promotion calendar based on operational, financial, market and strategic constraints.",
    "Demo": "",
    "Source": "https://www.theheinekencompany.com/newsroom/brewing-with-ai/",
    "Relevance": "Yes"
  }
]